DrClaudio73/STM32_HAL_RF24/RFLib/RF24old.cpp
/*
 Copyright (C) 2011 J. Coliz <maniacbug@ymail.com>

 This program is free software; you can redistribute it and/or
 modify it under the terms of the GNU General Public License
 version 2 as published by the Free Software Foundation.
 */

#include <stdio.h>
#include <string.h>

#include "RF24.hpp"

#include "nRF24L01.hpp"
#include "RF24_config.hpp"


/****************************************************************************/
void RF24::csn(bool mode)
{
    #if defined(RF24_TINY)
    if (ce_pin != csn_pin) {
        digitalWrite(csn_pin, mode);
    }
    else {
        if (mode == HIGH) {
            PORTB |= (1<<PINB2);  	// SCK->CSN HIGH
            delayMicroseconds(100); // allow csn to settle.
        }
        else {
            PORTB &= ~(1<<PINB2);	// SCK->CSN LOW
            delayMicroseconds(11);  // allow csn to settle
        }
    }
    // Return, CSN toggle complete
    return;

    #elif defined(ARDUINO) && !defined(RF24_SPI_TRANSACTIONS)
    // Minimum ideal SPI bus speed is 2x data rate
    // If we assume 2Mbs data rate and 16Mhz clock, a
    // divider of 4 is the minimum we want.
    // CLK:BUS 8Mhz:2Mhz, 16Mhz:4Mhz, or 20Mhz:5Mhz

        #if !defined(SOFTSPI)
        _SPI.setBitOrder(MSBFIRST);
        _SPI.setDataMode(SPI_MODE0);
                #if !defined(F_CPU) || F_CPU < 20000000
            _SPI.setClockDivider(SPI_CLOCK_DIV2);
                    #elif F_CPU < 40000000
            _SPI.setClockDivider(SPI_CLOCK_DIV4);
                    #elif F_CPU < 80000000
            _SPI.setClockDivider(SPI_CLOCK_DIV8);
                    #elif F_CPU < 160000000
            _SPI.setClockDivider(SPI_CLOCK_DIV16);
                    #elif F_CPU < 320000000
            _SPI.setClockDivider(SPI_CLOCK_DIV32);
                    #elif F_CPU < 640000000
            _SPI.setClockDivider(SPI_CLOCK_DIV64);
                    #elif F_CPU < 1280000000
            _SPI.setClockDivider(SPI_CLOCK_DIV128);
                    #else
                        #error "Unsupported CPU frequency. Please set correct SPI divider."
                    #endif

                #endif
    #elif defined(RF24_RPi)
    if(!mode)
      _SPI.chipSelect(csn_pin);
    #endif // defined(RF24_RPi)

    #if !defined(RF24_LINUX)
    digitalWrite(csn_pin, mode);
    delayMicroseconds(csDelay);
    #endif // !defined(RF24_LINUX)
}

/****************************************************************************/

void RF24::ce(bool level)
{
    //Allow for 3-pin use on ATTiny
    if (ce_pin != csn_pin) {
        digitalWrite(ce_pin, level);
    }
}

/****************************************************************************/

inline void RF24::beginTransaction()
{
    #if defined(RF24_SPI_TRANSACTIONS)
    _SPI.beginTransaction(SPISettings(spi_speed, MSBFIRST, SPI_MODE0));
    #endif // defined(RF24_SPI_TRANSACTIONS)
    csn(LOW);
}

/****************************************************************************/

inline void RF24::endTransaction()
{
    csn(HIGH);
    #if defined(RF24_SPI_TRANSACTIONS)
    _SPI.endTransaction();
    #endif // defined(RF24_SPI_TRANSACTIONS)
}

/****************************************************************************/

uint8_t RF24::read_register(uint8_t reg, uint8_t* buf, uint8_t len)
{
    uint8_t status;

    #if defined(RF24_LINUX)
    beginTransaction(); //configures the spi settings for RPi, locks mutex and setting csn low
    uint8_t * prx = spi_rxbuff;
    uint8_t * ptx = spi_txbuff;
    uint8_t size = len + 1; // Add register value to transmit buffer

    *ptx++ = ( R_REGISTER | ( REGISTER_MASK & reg ) );

    while (len--){ *ptx++ = RF24_NOP; } // Dummy operation, just for reading

    _SPI.transfernb( (char *) spi_txbuff, (char *) spi_rxbuff, size);

    status = *prx++; // status is 1st byte of receive buffer

    // decrement before to skip status byte
    while ( --size ){ *buf++ = *prx++; }
    endTransaction(); //unlocks mutex and setting csn high
    #else // !defined(RF24_LINUX)

    beginTransaction();
    status = _SPI.transfer(R_REGISTER | (REGISTER_MASK & reg));
    while (len--) {
        *buf++ = _SPI.transfer(0xff);
    }
    endTransaction();
    #endif // !defined(RF24_LINUX)

    return status;
}

/****************************************************************************/

uint8_t RF24::read_register(uint8_t reg)
{
    uint8_t result;

    #if defined(RF24_LINUX)
    beginTransaction();

    uint8_t * prx = spi_rxbuff;
    uint8_t * ptx = spi_txbuff;
    *ptx++ = ( R_REGISTER | ( REGISTER_MASK & reg ) );
    *ptx++ = RF24_NOP ; // Dummy operation, just for reading

    _SPI.transfernb( (char *) spi_txbuff, (char *) spi_rxbuff, 2);
    result = *++prx;   // result is 2nd byte of receive buffer

    endTransaction();
    #else // !defined(RF24_LINUX)

    beginTransaction();
    _SPI.transfer(R_REGISTER | (REGISTER_MASK & reg));
    result = _SPI.transfer(0xff);
    endTransaction();

    #endif // !defined(RF24_LINUX)

    return result;
}

/****************************************************************************/

uint8_t RF24::write_register(uint8_t reg, const uint8_t* buf, uint8_t len)
{
    uint8_t status;

    #if defined(RF24_LINUX)
    beginTransaction();
    uint8_t * prx = spi_rxbuff;
    uint8_t * ptx = spi_txbuff;
    uint8_t size = len + 1; // Add register value to transmit buffer

    *ptx++ = ( W_REGISTER | ( REGISTER_MASK & reg ) );
    while ( len-- )
      *ptx++ = *buf++;

    _SPI.transfernb( (char *) spi_txbuff, (char *) spi_rxbuff, size);
    status = *prx; // status is 1st byte of receive buffer
    endTransaction();
    #else // !defined(RF24_LINUX)

    beginTransaction();
    status = _SPI.transfer(W_REGISTER | (REGISTER_MASK & reg));
    while (len--) {
        _SPI.transfer(*buf++);
    }
    endTransaction();
    #endif // !defined(RF24_LINUX)

    return status;
}

/****************************************************************************/

uint8_t RF24::write_register(uint8_t reg, uint8_t value)
{
    uint8_t status;

    IF_SERIAL_DEBUG(printf_P(PSTR("write_register(%02x,%02x)\r\n"), reg, value));

    #if defined(RF24_LINUX)
    beginTransaction();
    uint8_t * prx = spi_rxbuff;
    uint8_t * ptx = spi_txbuff;
    *ptx++ = ( W_REGISTER | ( REGISTER_MASK & reg ) );
    *ptx = value ;

    _SPI.transfernb( (char *) spi_txbuff, (char *) spi_rxbuff, 2);
    status = *prx++; // status is 1st byte of receive buffer
    endTransaction();
    #else // !defined(RF24_LINUX)

    beginTransaction();
    status = _SPI.transfer(W_REGISTER | (REGISTER_MASK & reg));
    _SPI.transfer(value);
    endTransaction();

    #endif // !defined(RF24_LINUX)

