DrClaudio73/STM32_HAL_RF24/RFLib/RF24old.cpp
    config_reg = read_register(NRF_CONFIG);
    printf_P(PSTR("Primary Mode\t\t= %cX\r\n"), config_reg & _BV(PWR_UP) ? 'T' : 'R');
    print_address_register(PSTR("TX address\t"), TX_ADDR);

    uint8_t openPipes = read_register(EN_RXADDR);
    for (uint8_t i = 0; i < 6; ++i) {
        bool isOpen = openPipes & _BV(i);
        printf_P(PSTR("pipe %u ("
        PRIPSTR
        ") bound"), i, (char*)pgm_read_ptr(&rf24_feature_e_str_P[isOpen + 3]));
        if (i < 2) {
            print_address_register(PSTR(""), RX_ADDR_P0 + i);
        }
        else {
            print_byte_register(PSTR(""), RX_ADDR_P0 + i);
        }
    }
}
#endif // !defined(MINIMAL)

/****************************************************************************/

bool RF24::begin(void)
{

    #if defined(RF24_LINUX)

      #if defined(MRAA)
        GPIO();
        gpio.begin(ce_pin,csn_pin);
      #endif

      #if defined(RF24_RPi)
        switch(csn_pin){     //Ensure valid hardware CS pin
          case 0: break;
          case 1: break;
          // Allow BCM2835 enums for RPi
          case 8: csn_pin = 0; break;
          case 7: csn_pin = 1; break;
          case 18: csn_pin = 10; break;	//to make it work on SPI1
          case 17: csn_pin = 11; break;
          case 16: csn_pin = 12; break;
          default: csn_pin = 0; break;
        }
      #endif // RF24_RPi

      _SPI.begin(csn_pin,spi_speed);

      pinMode(ce_pin,OUTPUT);
      ce(LOW);
      delay(100);

    #elif defined(LITTLEWIRE)

      pinMode(csn_pin,OUTPUT);
      _SPI.begin();
      csn(HIGH);

    #elif defined(XMEGA_D3)
      if (ce_pin != csn_pin) {
        pinMode(ce_pin,OUTPUT);
      };
      _SPI.begin(csn_pin);
      ce(LOW);
      csn(HIGH);
      delay(200);
    #else
      // Initialize pins
      if (ce_pin != csn_pin) {
        //pinModeRF24(ce_port,ce_pin, OUTPUT);
        //pinModeRF24(csn_port,csn_pin, OUTPUT);
        pinModeRF24_ce_csn();
      }
      timerRF24.begin();
      uartRF24.begin();
      printf("Ciao uart e timer inizializzati\r\n");
      _SPI.begin();
      ce(LOW);
      csn(HIGH);
      #if defined(__ARDUINO_X86__)
        delay(100);
      #endif
    #endif //Linux

    // Must allow the radio time to settle else configuration bits will not necessarily stick.
    // This is actually only required following power up but some settling time also appears to
    // be required after resets too. For full coverage, we'll always assume the worst.
    // Enabling 16b CRC is by far the most obvious case if the wrong timing is used - or skipped.
    // Technically we require 4.5ms + 14us as a worst case. We'll just call it 5ms for good measure.
    // WARNING: Delay is based on P-variant whereby non-P *may* require different timing.
    delay(5);

    // Set 1500uS (minimum for 32B payload in ESB@250KBPS) timeouts, to make testing a little easier
    // WARNING: If this is ever lowered, either 250KBS mode with AA is broken or maximum packet
    // sizes must never be used. See documentation for a more complete explanation.
    setRetries(5, 15);   
 
    // Then set the data rate to the slowest (and most reliable) speed supported by all
    // hardware.
    setDataRate(RF24_1MBPS);

    // Disable dynamic payloads, to match dynamic_payloads_enabled setting - Reset value is 0
    toggle_features();
    write_register(FEATURE, 0);
    write_register(DYNPD, 0);
    dynamic_payloads_enabled = false;
    ack_payloads_enabled = false;

    // Reset current status
    // Notice reset and flush is the last thing we do
    write_register(NRF_STATUS, _BV(RX_DR) | _BV(TX_DS) | _BV(MAX_RT));

    // Set up default configuration.  Callers can always change it later.
    // This channel should be universally safe and not bleed over into adjacent
    // spectrum.
    setChannel(76);

    // Flush buffers
    flush_rx();
    flush_tx();

    // Clear CONFIG register, Enable PTX, Power Up & 16-bit CRC
    // Do not write CE high so radio will remain in standby I mode
    // PTX should use only 22uA of power
    write_register(NRF_CONFIG, (_BV(EN_CRC) | _BV(CRCO)) );    
    config_reg = read_register(NRF_CONFIG);

    powerUp();

    // if config is not set correctly then there was a bad response from module
    return config_reg == (_BV(EN_CRC) | _BV(CRCO) | _BV(PWR_UP)) ? true : false;
}

/****************************************************************************/

bool RF24::isChipConnected()
{
    uint8_t setup = read_register(SETUP_AW);
    if (setup >= 1 && setup <= 3) {
        return true;
    }

    return false;
}

/****************************************************************************/

void RF24::startListening(void)
{
    #if !defined(RF24_TINY) && !defined(LITTLEWIRE)
    powerUp();
    #endif
    /* Notes Once ready for next release
    * 1. Can update stopListening() to use config_reg var and ack_payloads_enabled var instead of SPI rx/tx
    * 2. Update txDelay defaults: 240 for 2MBPS, 280 for 1MBPS, 505 for 250KBPS per initial testing
    * 3. Allows time for slower devices to update with the faster startListening() function prior to updating stopListening() & adjusting txDelay
    */
    config_reg |= _BV(PRIM_RX);
    write_register(NRF_CONFIG,config_reg);
    write_register(NRF_STATUS, _BV(RX_DR) | _BV(TX_DS) | _BV(MAX_RT));
    ce(HIGH);
    // Restore the pipe0 adddress, if exists
    if (pipe0_reading_address[0] > 0) {
        write_register(RX_ADDR_P0, pipe0_reading_address, addr_width);
    } else {
        closeReadingPipe(0);
    }

    if(ack_payloads_enabled){
        flush_tx();
    }

}

/****************************************************************************/
static const uint8_t child_pipe_enable[]
PROGMEM = {ERX_P0, ERX_P1, ERX_P2, ERX_P3, ERX_P4, ERX_P5};

void RF24::stopListening(void)
{
    ce(LOW);

    delayMicroseconds(txDelay);

    if (read_register(FEATURE) & _BV(EN_ACK_PAY)) {
        delayMicroseconds(txDelay); //200
        flush_tx();
    }
    //flush_rx();
    config_reg &= ~_BV(PRIM_RX);
    write_register(NRF_CONFIG, (read_register(NRF_CONFIG)) & ~_BV(PRIM_RX));

    #if defined(RF24_TINY) || defined(LITTLEWIRE)
    // for 3 pins solution TX mode is only left with additonal powerDown/powerUp cycle
    if (ce_pin == csn_pin) {
      powerDown();
      powerUp();
    }
    #endif
    write_register(EN_RXADDR, read_register(EN_RXADDR) | _BV(pgm_read_byte(&child_pipe_enable[0]))); // Enable RX on pipe0

    //delayMicroseconds(100);

