DrClaudio73/STM32_HAL_RF24/RFLib/RF24old.cpp
/****************************************************************************/
void RF24::stopConstCarrier()
{   
    write_register(RF_SETUP, (read_register(RF_SETUP)) & ~_BV(CONT_WAVE));
    write_register(RF_SETUP, (read_register(RF_SETUP)) & ~_BV(PLL_LOCK));
    ce(LOW);
}


void RF24::digitalWrite(uint16_t pin, bool value){
	if (pin == ce_pin){
		HAL_GPIO_WritePin(ce_port, ce_pin, (GPIO_PinState) value);
	}
	if (pin== csn_pin){
		HAL_GPIO_WritePin(csn_port, csn_pin, (GPIO_PinState) value);
	}
}

void RF24::delayMicroseconds(uint16_t us){
	timerRF24.setCNT(0); //da mettere come .setCNT(0)
	//__HAL_TIM_SET_COUNTER(&(timerRF24.htim_us),1);  // set the counter value a 0
	uint16_t counter = timerRF24.getCNT();

	while (counter < us){
		counter = timerRF24.getCNT();  // wait for the counter to reach the us input in the parameter
	}
}

uint32_t RF24::millis(void){
	return (timerRF24.getCNT()*1000);
}

void RF24::pinModeRF24_ce_csn(void){
	GPIO_InitTypeDef GPIO_InitStruct = {0};

	/* GPIO Ports Clock Enable */
	switch ((int)ce_port){
	case(GPIOA_BASE): __HAL_RCC_GPIOA_CLK_ENABLE(); break;
	case(GPIOB_BASE): __HAL_RCC_GPIOB_CLK_ENABLE(); break;
	case(GPIOC_BASE): __HAL_RCC_GPIOC_CLK_ENABLE(); break;
	case(GPIOD_BASE): __HAL_RCC_GPIOD_CLK_ENABLE(); break;
	}

	switch ((int)csn_port){
	case(GPIOA_BASE): __HAL_RCC_GPIOA_CLK_ENABLE(); break;
	case(GPIOB_BASE): __HAL_RCC_GPIOB_CLK_ENABLE(); break;
	case(GPIOC_BASE): __HAL_RCC_GPIOC_CLK_ENABLE(); break;
	case(GPIOD_BASE): __HAL_RCC_GPIOD_CLK_ENABLE(); break;
	}

	//__HAL_RCC_GPIOA_CLK_ENABLE();
	//__HAL_RCC_GPIOB_CLK_ENABLE();

	/*Configure GPIO pin Output Level */
	//HAL_GPIO_WritePin(csn_pin_GPIO_Port, csn_pin_Pin, GPIO_PIN_SET);
	HAL_GPIO_WritePin(csn_port, csn_pin, GPIO_PIN_SET);

	/*Configure GPIO pin Output Level */
	HAL_GPIO_WritePin(ce_port, ce_pin, GPIO_PIN_RESET);

	/*Configure GPIO pin : csn_pin_Pin */
	GPIO_InitStruct.Pin = csn_pin;
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
	HAL_GPIO_Init(csn_port, &GPIO_InitStruct);

	/*Configure GPIO pin : ce_pin_Pin */
	GPIO_InitStruct.Pin = ce_pin;
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
	HAL_GPIO_Init(ce_port, &GPIO_InitStruct);
}

//ATTiny support code pulled in from https://github.com/jscrane/RF24
#if defined(RF24_TINY)

void SPIClass::begin() {
    // set USCK and DO for output
    // set DI for input
        #if defined(__AVR_ATtiny25__) || defined(__AVR_ATtiny45__) || defined(__AVR_ATtiny85__)
    DDRB |= (1 << PB2) | (1 << PB1);
    DDRB &= ~(1 << PB0);
        #elif defined(__AVR_ATtiny24__) || defined(__AVR_ATtiny44__) || defined(__AVR_ATtiny84__)
    DDRA |= (1 << PA4) | (1 << PA5);
    DDRA &= ~(1 << PA6);
        #elif defined(__AVR_ATtiny2313__) || defined(__AVR_ATtiny4313__)
    DDRB |= (1 << PB7) | (1 << PB6);
    DDRB &= ~(1 << PB5);
        #elif defined(__AVR_ATtiny861__)
    DDRB |= (1 << PB2) | (1 << PB1);
    DDRB &= ~(1 << PB0);
        #endif // defined(__AVR_ATtiny861__)
    USICR = _BV(USIWM0);
}

byte SPIClass::transfer(byte b)
{
    USIDR = b;
    USISR = _BV(USIOIF);
    do {
        USICR = _BV(USIWM0) | _BV(USICS1) | _BV(USICLK) | _BV(USITC);
    }
    while ((USISR & _BV(USIOIF)) == 0);
    return USIDR;
}

void SPIClass::end() {}
void SPIClass::setDataMode(uint8_t mode){}
void SPIClass::setBitOrder(uint8_t bitOrder){}
void SPIClass::setClockDivider(uint8_t rate){}

#endif
